app/controllers/api/v1/alerts_controller.rb

SELECT "alerts".* FROM "alerts" WHERE "alerts"."user_id" = $1 AND "alerts"."cryptocurrency_id" = $2 AND "alerts"."status" = $3 AND "alerts"."target_price" = $4 LIMIT $5  [["user_id", 1], ["cryptocurrency_id", 1], ["status", "active"], ["target_price", "33000.0"], ["LIMIT", 1]]
SELECT "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "alerts" ("user_id", "cryptocurrency_id", "target_price", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["cryptocurrency_id", 1], ["target_price", "400000.0"], ["status", "active"], ["created_at", "2023-05-23 09:50:23.580764"], ["updated_at", "2023-05-23 09:50:23.580764"]]
---
  def create
    @alert = Alert.new(alert_params)

    existing_alert = Alert.find_by(user_id: params[:user_id], cryptocurrency_id: params[:cryptocurrency_id],
                                   status: Alert::Status::ACTIVE, target_price: params[:target_price])
    if existing_alert
      render json: { success: false, error: 'User already has an active alert for this cryptocurrency' },
             status: :unprocessable_entity
      return
    end

    symbol = Cryptocurrency.find_by(id: params[:cryptocurrency_id])&.symbol
    current_price = CoingeckoService.fetch_latest_price(symbol)

    if current_price && @alert.target_price <= current_price
      render json: { success: false, error: 'Target price must be greater than the current price' }, status: :unprocessable_entity
      return
    end

    if @alert.save

SELECT "alerts".* FROM "alerts" WHERE "alerts"."id" = $1 AND "alerts"."status" = $2 ORDER BY "alerts"."id" DESC LIMIT $3  [["id", 1], ["status", "active"], ["LIMIT", 1]]
SELECT "alerts".* FROM "alerts" WHERE "alerts"."id" = $1 AND "alerts"."status" = $2 ORDER BY "alerts"."id" DESC LIMIT $3  [["id", 3], ["status", "active"], ["LIMIT", 1]]
UPDATE "alerts" SET "status" = $1, "updated_at" = $2 WHERE "alerts"."id" = $3  [["status", "deleted"], ["updated_at", "2023-05-23 09:50:29.891627"], ["id", 1]]
---
  def destroy
    @alert = Alert.where(id: params[:id], status: Alert::Status::ACTIVE).last
    return render json: { error: 'Alert not found' }, status: :not_found unless @alert.present?

    # soft delete
    if @alert.update(status: Alert::Status::DELETED)

SELECT "alerts".* FROM "alerts" WHERE "alerts"."user_id" = $1 AND "alerts"."status" = $2 LIMIT $3 OFFSET $4  [["user_id", 1], ["status", "deleted"], ["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "alerts" WHERE "alerts"."user_id" = $1 AND "alerts"."status" = $2  [["user_id", 1], ["status", "deleted"]]
SELECT "alerts".* FROM "alerts" WHERE "alerts"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    page = params[:page].to_i || 10
    per_page = params[:per_page].to_i || 10
    user_id = params.require(:user_id)

    # cache_key = "alerts_#{user_id}"
    # alerts = RedisWrapper.get(cache_key)
    # if alerts.nil?
    # RedisWrapper.set(cache_key, alerts, 1.minutes.to_i)
    # end
    #

    alerts = Alert.where(user_id: user_id)
                  .filter_by_status(params[:status])
                  .paginate(page: page, per_page: per_page)

    render json: {
      alert: AlertSerializer.new(alerts, { meta: { pagination: { page: page, per_page: per_page, total: alerts.count} } }).serializable_hash